package App;

public class A222 {

	public static void main(String[] args) {
		
		/*
		 여러명의 점수 데이터가 존재 합니다
		 프로그램 실행시 해당 사용자 이름을 입력합니다.
		 해당 점수 데이터 중 사용자 이름과 동일한 데이터만 출력 되도록 합니다.
		 프로세서 실행 결과
		 검색할 데이터 학생명을 입력해주세요. 홍길동
		 검색할 과목 점수 [전체]? 전체
		 결과 
		 검색 데이터 학생명 : 홍길동
		 점수데이터 : 국어:55 수학:60 과학:77 역사:90
		 
		 데이터 값
	     {
		 {"박은경","이경훈","장운","조기현","김진수"},
		 {"80","78","92","67","40"},
		 {"40","80","80","92","100"},
		 {"95","30","55","90","65"},
		 {"20","80","100","95","30"}
		 }
		 A파트
		 사용자가 해당 질문을 입력할수있는 프로세서를 제작
		 최종 결과 값을 return받아서 처리애햐 합니다
		 단, 해당 데이터에 없는 사용자를 입력할경우 데이터를 찾지 못했습니다. 출력
		 또한, 과목을 전체로 입력할 경우 국거 ~역사 까지 모두 출력 합니다.
		 해당 특정 과목을 입력할 경우 해당 과목 점수만 출력 되도록 합니다.
		 */
		 
		 

		
	}

}
